
'use client'
import { Card, CardBody, CardHeader } from "@nextui-org/card";
import { Accordion, AccordionItem } from "@nextui-org/react";
import { UserIcon } from "@heroicons/react/24/outline";


export default function CashHelp() {

  return (         
    <Card shadow="none">
    <CardHeader>
        <h3 className="text-primary font-bold">راهنمای خرید نقدی</h3>
    </CardHeader>
    <CardBody className='p-2 text-right'>        
        <Accordion className="leading-8">
        <AccordionItem key="1" aria-label="ثبت نام" title="ثبت نام">
             برای ثبت نام یا ورود به حساب کاربری خود کافی است ابتدا از قسمت بالای سایت انار چین، آیکون ورود                 
                <a href={'/login/'}>
                <div className="m-2 inline-flex h-11 w-11 items-center justify-center rounded-md border border-neutral-200 text-black transition-colors dark:border-neutral-700 dark:text-white">
                    <UserIcon className='h-4 transition-all ease-in-out hover:scale-110' />
                </div>
                </a>                
            را انتخاب نمایید، در پنجره جدیدی که باز می شود، شماره موبایل خود را وارد نموده و با انتخاب کلید " ورود" یک کد یکبار مصرف برای شما پیامک می شود. با وارد نمودن کد در بخش مربوطه، شما وارد حساب کاربری خود می شوید و می توانید با تکمیل اطلاعات درخواستی ثبت نام خود را تکمیل نمایید.  
        </AccordionItem>
            <AccordionItem key="2" aria-label="انتخاب محصولات" title="انتخاب محصولات">
            <ul className="list-disc p-4">
            <li>جهت خرید محصول با کلیک بر روی دسته بندی محصولات در بالای صفحه سایت و یا استفاده از نوار جستجو، دسته مورد نظر خود را انتخاب نمایید.</li>
            <li>پس از انتخاب محصول مورد نظر بر روی آن کلیک کرده و با انتقال به صفحه مربوطه بر روی آیکون "افزودن به سبد خرید" کلیک نمایید تا محصول مورد نظر به سبد خرید شما اضافه شود.</li>
            <li>در حال حاضر امکان انتخاب بیش از دو عدد از هر محصول امکان پذیر نمی باشد.</li>
            <li>در هرصفحه ای که باشید، جهت مشاهده سریع سبد خرید و مبلغ آن می توانید با قرارگرفتن یا کلیک بر روی آیکون "سبد خرید" در بالای صفحه سمت چپ از محتویات آن اطلاع پیدا کنید.</li>
            <li>در این مرحله با ورود به سبد خرید امکان افزودن به تعداد محصول و یا حذف آنها از سبد خرید وجود دارد.</li>
            <li>پس از انتخاب محصول، پنجره ای برای شما باز می شود که در صورت تمایل به اتمام خرید و پرداخت سفارش، می توانید بر روی گزینه "تکمیل سفارش و پرداخت " کلیک نمایید و یا چنانچه به دنبال جستجو و خرید محصولات دیگر هستید ، گزینه "ادامه خرید " را انتخاب نموده و به صفحات قبلی باز گردید.</li>
            <li>پس از اتمام خرید وارد سبد خرید خود شده و در صورت داشتن کد تخفیف ، کارت هدیه و یا کارت اشتراک ، آن را در کادر مربوطه وارد نمایید و در آخر کلید "پرداخت و خرید" را فشار دهید.</li>
            </ul>
        </AccordionItem>
        <AccordionItem key="3" aria-label="پرداخت آنلاین" title="پرداخت آنلاین">
            <div>
                <p>همگی کاربران فروشگاه اینترنتی انارچین می‌توانند در هنگام ثبت سفارش ، از طریق درگاه اینترنتی بانک‌ سامان در سایت فروشگاه اینترنتی انارچین ، هزینه سفارش خود را به صورت آنلاین پرداخت کنند. پرداخت موفق مبلغ به منزله ثبت قطعی این پرداخت برای سفارش است و نیازی به اطلاع دادن آن نیست و سفارش به صورت خودکار وارد مراحل آماده سازی و ارسال می‌شود. همچنین، پرداخت اینترنتی باعث ایجاد اولویت و تسریع در پردازش سفارش کاربران می‌شود.</p>
                <h4>چگونگی پرداخت اینترنتی:</h4>
                <p>کاربران محترم سایت فروشگاه اینترنتی انارچین می‌توانند مبلغ سفارش خود را با استفاده از همه کارت‌های بانکی عضو شبکه شتاب پرداخت کنند. هم اکنون، با کارت بانک‌های ملی، صادرات، پارسیان، سامان، اقتصاد نوین، پاسارگاد، ملت، کشاورزی، توسعه صادرات، صنعت و معدن، بانک سینا ، خاورمیانه و کارآفرین امکان خرید اینترنتی وجود دارد.</p>
                <p>هنگام پرداخت اینترنتی اطلاعات زیر از شما پرسیده می‌شود که پس از وارد کردن آنها و تایید پرداخت، از موفقیت عملیات پرداخت خود مطلع می‌شوید.</p>
                <h4>شماره 16 رقمی کارت:</h4>
                <p>این شماره در کارت همه بانک‌ها، بر روی کارت درج شده است.</p>
                <h4>رمز خرید اینترنتی یا رمز دوم:</h4>
                <p>برای پرداخت اینترنتی لازم است قبلاْ رمز دوم (رمز خرید اینترنتی) کارت بانکی خود را فعال کرده باشید. رمز دوم (رمز خرید اینترنتی)، با رمزی که شما هنگام استفاده از دستگاه‌های خود پرداز وارد می‌کنید، تفاوت دارد. برخی از بانک‌ها مثل بانک سامان معمولاً رمز اینترنتی را هنگام صدور کارت تحویل می‌دهند، اما کارت بیشتر بانک‌ها در زمان تحویل، رمز خرید اینترنتی ندارند، برای فعال کردن رمز خرید اینترنتی، می‌توانید به دستگاه خودپرداز بانک صادر کننده کارت خود مراجعه و کارت خود را وارد کنید و بخش عملیات رمز را انتخاب کنید. سپس، در بخش رمز دوم یا رمز اینترنتی، رمز خود را انتخاب کنید.</p>
                <h4>کد CVV2:</h4>
                <p>این کد یک عدد 3 یا 4 رقمی است که پشت یا روی کارت‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌های بانکی درج می‌شود و به‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌عنوان یک کد امنیتی در پرداخت‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌های اینترنتی کاربرد دارد. این کد روی کارت‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌ بانک‌های ملت، صادرات، پاسارگاد، سامان، پارسیان و... به صورت یک عدد 3 رقمی حک شده است یا در برخی کارت ها مانند بانک ملی 4 رقمی است.</p>
                <h4>تاریخ انقضاء:</h4>
                <p>تاریخ انقضاء روی بیشتر کارت‌های بانکی حک شده است. اگر روی کارت شما تاریخ انقضاء وجود ندارد، می‌توانید از عدد 12 به جای ماه و از 99 به جای سال انقضای کارت استفاده کنید.</p>
            </div>
        </AccordionItem> 
        </Accordion>
    </CardBody>
    </Card>
  );
}